EasyKidsRoboticsDev/arduino-easykidsrobotics/boards.txt
# Official Espressif options
menu.UploadSpeed=Upload Speed
menu.USBMode=USB Mode
menu.CDCOnBoot=USB CDC On Boot
menu.MSCOnBoot=USB Firmware MSC On Boot
menu.DFUOnBoot=USB DFU On Boot
menu.UploadMode=Upload Mode
menu.CPUFreq=CPU Frequency
menu.FlashFreq=Flash Frequency
menu.FlashMode=Flash Mode
menu.FlashSize=Flash Size
menu.PartitionScheme=Partition Scheme
menu.DebugLevel=Core Debug Level
menu.PSRAM=PSRAM
menu.LoopCore=Arduino Runs On
menu.EventsCore=Events Run On
menu.MemoryType=Memory Type
menu.EraseFlash=Erase All Flash Before Sketch Upload
menu.JTAGAdapter=JTAG Adapter

# Custom options
menu.Revision=Board Revision
menu.LORAWAN_REGION=LoRaWan Region
menu.LoRaWanDebugLevel=LoRaWan Debug Level
menu.LORAWAN_DEVEUI=LoRaWan DevEUI
menu.LORAWAN_PREAMBLE_LENGTH=LoRaWan Preamble Length

##############################################################
### DO NOT PUT BOARDS ABOVE THE OFFICIAL ESPRESSIF BOARDS! ###
##############################################################

3in1easykids.name=3in1EasyKids Robot Kit

3in1easykids.bootloader.tool=esptool_py
3in1easykids.bootloader.tool.default=esptool_py

3in1easykids.upload.tool=esptool_py
3in1easykids.upload.tool.default=esptool_py
3in1easykids.upload.tool.network=esp_ota

3in1easykids.upload.maximum_size=1310720
3in1easykids.upload.maximum_data_size=327680
3in1easykids.upload.flags=
3in1easykids.upload.extra_flags=

3in1easykids.serial.disableDTR=true
3in1easykids.serial.disableRTS=true

3in1easykids.build.tarch=xtensa
3in1easykids.build.bootloader_addr=0x1000
3in1easykids.build.target=esp32
3in1easykids.build.mcu=esp32
3in1easykids.build.core=esp32
3in1easykids.build.variant=3in1easykids
3in1easykids.build.board=ESP32_DEV

3in1easykids.build.f_cpu=240000000L
3in1easykids.build.flash_size=4MB
3in1easykids.build.flash_freq=80m
3in1easykids.build.flash_mode=dio
3in1easykids.build.boot=dio
3in1easykids.build.partitions=default
3in1easykids.build.defines=
3in1easykids.build.loop_core=
3in1easykids.build.event_core=


3in1easykids.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
3in1easykids.menu.PartitionScheme.default.build.partitions=default
3in1easykids.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
3in1easykids.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
3in1easykids.menu.PartitionScheme.default_8MB=8M with spiffs (3MB APP/1.5MB SPIFFS)
3in1easykids.menu.PartitionScheme.default_8MB.build.partitions=default_8MB
3in1easykids.menu.PartitionScheme.default_8MB.upload.maximum_size=3342336
3in1easykids.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
3in1easykids.menu.PartitionScheme.minimal.build.partitions=minimal
3in1easykids.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
3in1easykids.menu.PartitionScheme.no_ota.build.partitions=no_ota
3in1easykids.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
3in1easykids.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
3in1easykids.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
3in1easykids.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
3in1easykids.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
3in1easykids.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
3in1easykids.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
3in1easykids.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
3in1easykids.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
3in1easykids.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
3in1easykids.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
3in1easykids.menu.PartitionScheme.huge_app.build.partitions=huge_app
3in1easykids.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
3in1easykids.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
3in1easykids.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
3in1easykids.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
3in1easykids.menu.PartitionScheme.fatflash=16M Flash (2MB APP/12.5MB FATFS)
3in1easykids.menu.PartitionScheme.fatflash.build.partitions=ffat
3in1easykids.menu.PartitionScheme.fatflash.upload.maximum_size=2097152
3in1easykids.menu.PartitionScheme.app3M_fat9M_16MB=16M Flash (3MB APP/9.9MB FATFS)
3in1easykids.menu.PartitionScheme.app3M_fat9M_16MB.build.partitions=app3M_fat9M_16MB
3in1easykids.menu.PartitionScheme.app3M_fat9M_16MB.upload.maximum_size=3145728
3in1easykids.menu.PartitionScheme.rainmaker=RainMaker
3in1easykids.menu.PartitionScheme.rainmaker.build.partitions=rainmaker
3in1easykids.menu.PartitionScheme.rainmaker.upload.maximum_size=3145728

3in1easykids.menu.UploadSpeed.921600=921600
3in1easykids.menu.UploadSpeed.921600.upload.speed=921600
3in1easykids.menu.UploadSpeed.115200=115200
3in1easykids.menu.UploadSpeed.115200.upload.speed=115200
3in1easykids.menu.UploadSpeed.256000.windows=256000
3in1easykids.menu.UploadSpeed.256000.upload.speed=256000
3in1easykids.menu.UploadSpeed.230400.windows.upload.speed=256000
3in1easykids.menu.UploadSpeed.230400=230400
3in1easykids.menu.UploadSpeed.230400.upload.speed=230400
3in1easykids.menu.UploadSpeed.460800.linux=460800
3in1easykids.menu.UploadSpeed.460800.macosx=460800
3in1easykids.menu.UploadSpeed.460800.upload.speed=460800
3in1easykids.menu.UploadSpeed.512000.windows=512000
3in1easykids.menu.UploadSpeed.512000.upload.speed=512000

3in1easykids.menu.DebugLevel.none=None
3in1easykids.menu.DebugLevel.none.build.code_debug=0
3in1easykids.menu.DebugLevel.error=Error
3in1easykids.menu.DebugLevel.error.build.code_debug=1
3in1easykids.menu.DebugLevel.warn=Warn
3in1easykids.menu.DebugLevel.warn.build.code_debug=2
3in1easykids.menu.DebugLevel.info=Info
3in1easykids.menu.DebugLevel.info.build.code_debug=3
3in1easykids.menu.DebugLevel.debug=Debug
3in1easykids.menu.DebugLevel.debug.build.code_debug=4
3in1easykids.menu.DebugLevel.verbose=Verbose
3in1easykids.menu.DebugLevel.verbose.build.code_debug=5

3in1easykids.menu.EraseFlash.none=Disabled
3in1easykids.menu.EraseFlash.none.upload.erase_cmd=
3in1easykids.menu.EraseFlash.all=Enabled
3in1easykids.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################
